# Terraform - genesis
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
src/shared/infrastructure/genesis relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/genesis/runs/run-Cp6LVBVWweXSSnor

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.common_resources_production.data.tfe_organization.default: Refreshing...
module.common_resources_staging.data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_production.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
tfe_project.shared_project_name: Refreshing state... [id=prj-JCscfrTkxawdM81N]
module.common_resources_production.tfe_project.default: Refreshing state... [id=prj-Twr8YADBcPjLxJbj]
module.common_resources_production.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-NstF9fTh6Kbx2Tsn]
module.common_resources_production.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-cdgB27WtH6HyZUBQ]
module.common_resources_production.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-PeSNTqaiRPhKuDcU]
module.common_resources_production.module.web.tfe_workspace.web: Refreshing state... [id=ws-XTHcmG2f14R4fpvq]
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-H1GqAFrcf7HPi59f]
module.common_resources_production.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-KgLKDHFJfZCmpKjJ]
module.common_resources_production.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-iesjxRYUGdMbTP6r]
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-1r37h4X21dSLHGjU]
module.common_resources_production.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-67RfL7sY7cd2grbv]
module.common_resources_production.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-n3PHTaoWdSTtJUWR]
tfe_workspace.shared: Refreshing state... [id=ws-egstaNBtgYYQvzBR]
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-45pjbgvgyw7WQzcv]
module.common_resources_staging.data.tfe_organization.default: Refresh complete after 1s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_staging.tfe_project.default: Refreshing state... [id=prj-Acb5fDpVmGfmUr5J]
module.common_resources_staging.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-k7prGLUZkJnBoj6i]
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-NkCvKvoi6zAUnYYU]
module.common_resources_staging.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-uULA9VXHScr67SGG]
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-DL6wqnwyFuU3EHUq]
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-DvwiKUZkPfSBEswF]
module.common_resources_staging.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-9ZjRh1Bn8Sya8TNG]
module.common_resources_staging.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-UtD93rqNo1SZuT4r]
module.common_resources_staging.module.web.tfe_workspace.web: Refreshing state... [id=ws-9JB9xuXLnvq1en68]
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-8XydyMGNUZ5NnqaC]
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-fozD4drz6d9aQrAi]
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-kY3z6QiUYgdGYtHM]
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_production.module.shared.tfe_workspace.shared: Drift detected (update)
tfe_workspace.shared: Drift detected (update)
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_staging.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_staging.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_production.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tfe_project.shared_project_name must be replaced
-/+ resource "tfe_project" "shared_project_name" {
      ~ id           = "prj-JCscfrTkxawdM81N" -> (known after apply)
        name         = "shared"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/shared" -> (known after apply)
      ~ id                            = "ws-egstaNBtgYYQvzBR" -> (known after apply)
        name                          = "shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-JCscfrTkxawdM81N" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
        name         = "production"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_staging.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
        name         = "staging"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-45pjbgvgyw7WQzcv" -> (known after apply)
        name                          = "production_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 6 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer" -> (known after apply)
      ~ id                            = "ws-NstF9fTh6Kbx2Tsn" -> (known after apply)
        name                          = "production_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer_api" -> (known after apply)
      ~ id                            = "ws-iesjxRYUGdMbTP6r" -> (known after apply)
        name                          = "production_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gateway_api" -> (known after apply)
      ~ id                            = "ws-1r37h4X21dSLHGjU" -> (known after apply)
        name                          = "production_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-H1GqAFrcf7HPi59f" -> (known after apply)
        name                          = "production_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 6 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity" -> (known after apply)
      ~ id                            = "ws-PeSNTqaiRPhKuDcU" -> (known after apply)
        name                          = "production_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity_api" -> (known after apply)
      ~ id                            = "ws-KgLKDHFJfZCmpKjJ" -> (known after apply)
        name                          = "production_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization" -> (known after apply)
      ~ id                            = "ws-cdgB27WtH6HyZUBQ" -> (known after apply)
        name                          = "production_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization_api" -> (known after apply)
      ~ id                            = "ws-n3PHTaoWdSTtJUWR" -> (known after apply)
        name                          = "production_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_shared" -> (known after apply)
      ~ id                            = "ws-67RfL7sY7cd2grbv" -> (known after apply)
        name                          = "production_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 9 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_web" -> (known after apply)
      ~ id                            = "ws-XTHcmG2f14R4fpvq" -> (known after apply)
        name                          = "production_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Twr8YADBcPjLxJbj" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-NkCvKvoi6zAUnYYU" -> (known after apply)
        name                          = "staging_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 6 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer" -> (known after apply)
      ~ id                            = "ws-UtD93rqNo1SZuT4r" -> (known after apply)
        name                          = "staging_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer_api" -> (known after apply)
      ~ id                            = "ws-8XydyMGNUZ5NnqaC" -> (known after apply)
        name                          = "staging_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gateway_api" -> (known after apply)
      ~ id                            = "ws-DvwiKUZkPfSBEswF" -> (known after apply)
        name                          = "staging_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 12 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-kY3z6QiUYgdGYtHM" -> (known after apply)
        name                          = "staging_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 6 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity" -> (known after apply)
      ~ id                            = "ws-k7prGLUZkJnBoj6i" -> (known after apply)
        name                          = "staging_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity_api" -> (known after apply)
      ~ id                            = "ws-fozD4drz6d9aQrAi" -> (known after apply)
        name                          = "staging_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization" -> (known after apply)
      ~ id                            = "ws-uULA9VXHScr67SGG" -> (known after apply)
        name                          = "staging_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization_api" -> (known after apply)
      ~ id                            = "ws-DL6wqnwyFuU3EHUq" -> (known after apply)
        name                          = "staging_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_shared" -> (known after apply)
      ~ id                            = "ws-9ZjRh1Bn8Sya8TNG" -> (known after apply)
        name                          = "staging_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 9 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_web" -> (known after apply)
      ~ id                            = "ws-9JB9xuXLnvq1en68" -> (known after apply)
        name                          = "staging_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-Acb5fDpVmGfmUr5J" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

Plan: 26 to add, 0 to change, 26 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*